Revit 2027 API
FabricationConfiguration.GetStiffenerName Method
 Gets the stiffener name from its database identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetStiffenerName(
	int stiffenerId
)
Public Function GetStiffenerName (
	stiffenerId As Integer
) As String
public:
String^ GetStiffenerName(
	int stiffenerId
)
member GetStiffenerName :
        stiffenerId : int -> string
Parameters
stiffenerId Int32
 The stiffener database identifier.
Return Value
String
 The stiffener name.
Exceptions
Exception | Condition
ArgumentException |  The stiffener does not exist.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace